tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Cygnal/REG51Si1000.H
/* New registers for B1 radio */
#define  EZRADIOPRO_AFC_LIMITER                                0x2A
#define  EZRADIOPRO_AFC_CORRECTION                             0x2B
#define  EZRADIOPRO_OOK_COUNTER_VALUE_1                        0x2C
#define  EZRADIOPRO_OOK_COUNTER_VALUE_2                        0X2D
#define  EZRADIOPRO_SLICER_PEAK_HOLD                           0X2E
#define  EZRADIOPRO_ADC8_CONTROL                               0x4F
#define  EZRADIOPRO_INVALID_PREAMBLE_THRESHOLD_AND_PA_MISC     0x54
#define  EZRADIOPRO_MISCELLANEOUS_SETTINGS                     0x78
#define  EZRADIOPRO_TURN_AROUND_AND_15_4_LENGTH_COMPLIANCE     0x7B


/* Register Bit Masks */

/* EZRADIOPRO_DEVICE_TYPE                                      0x00 */
#define  EZRADIOPRO_DT_MASK            0x1F
/* EZRADIOPRO_DEVICE_VERSION                                   0x01 */
#define  EZRADIOPRO_VC_MASK            0x1F
/* EZRADIOPRO_DEVICE_STATUS                                    0x02 */
#define  EZRADIOPRO_CPS_MASK           0x03
#define  EZRADIOPRO_LOCKDET            0x04
#define  EZRADIOPRO_FREQERR            0x08
#define  EZRADIOPRO_HEADERR            0x10
#define  EZRADIOPRO_RXFFEM             0x20
#define  EZRADIOPRO_FFUNFL             0x40
#define  EZRADIOPRO_FFOVFL             0x80

/* EZRADIOPRO_INTERRUPT_STATUS_1                               0x03 */
#define  EZRADIOPRO_ICRCERROR          0x01
#define  EZRADIOPRO_IPKVALID           0x02
#define  EZRADIOPRO_IPKSENT            0x04
#define  EZRADIOPRO_IEXT               0x08
#define  EZRADIOPRO_IRXFFAFULL         0x10
#define  EZRADIOPRO_ITXFFAEM           0x20
#define  EZRADIOPRO_ITXFFAFULL         0x40
#define  EZRADIOPRO_IFFERR             0x80

/* EZRADIOPRO_INTERRUPT_STATUS_2                               0x04 */
#define  EZRADIOPRO_IPOR               0x01
#define  EZRADIOPRO_ICHIPRDY           0x02
#define  EZRADIOPRO_ILBD               0x04
#define  EZRADIOPRO_IWUT               0x08
#define  EZRADIOPRO_IRSSI              0x10
#define  EZRADIOPRO_IPREAINVAL         0x20
#define  EZRADIOPRO_IPREAVAL           0x40
#define  EZRADIOPRO_ISWDET             0x80

/* EZRADIOPRO_INTERRUPT_ENABLE_1                               0x05 */
#define  EZRADIOPRO_ENCRCERROR         0x01
#define  EZRADIOPRO_ENPKVALID          0x02
#define  EZRADIOPRO_ENPKSENT           0x04
#define  EZRADIOPRO_ENEXT              0x08
#define  EZRADIOPRO_ENRXFFAFULL        0x10
#define  EZRADIOPRO_ENTXFFAEM          0x20
#define  EZRADIOPRO_ENTXFFAFULL        0x40
#define  EZRADIOPRO_ENFFERR            0x80

/* EZRADIOPRO_INTERRUPT_ENABLE_2                               0x06 */
#define  EZRADIOPRO_ENPOR              0x01
#define  EZRADIOPRO_ENCHIPRDY          0x02
#define  EZRADIOPRO_ENLBDI             0x04
#define  EZRADIOPRO_ENWUT              0x08
#define  EZRADIOPRO_ENRSSI             0x10
#define  EZRADIOPRO_ENPREAINVAL        0x20
#define  EZRADIOPRO_ENPREAVAL          0x40
#define  EZRADIOPRO_ENSWDET            0x80

/* EZRADIOPRO_OPERATING_FUNCTION_CONTROL_1                     0x07 */
#define  EZRADIOPRO_XTON               0x01
#define  EZRADIOPRO_PLLON              0x02
#define  EZRADIOPRO_RXON               0x04
#define  EZRADIOPRO_TXON               0x08
#define  EZRADIOPRO_X32KSEL            0x10
#define  EZRADIOPRO_ENWT               0x20
#define  EZRADIOPRO_ENLBD              0x40
#define  EZRADIOPRO_SWRES              0x80

/* EZRADIOPRO_OPERATING_FUNCTION_CONTROL_2                     0x08 */
#define  EZRADIOPRO_FFCLRTX            0x01
#define  EZRADIOPRO_FFCLRRX            0x02
#define  EZRADIOPRO_ENLDM              0x04
#define  EZRADIOPRO_AUTOTX             0x08
#define  EZRADIOPRO_RXMPK              0x10
#define  EZRADIOPRO_ANTDIV_MASK        0xE0

/* EZRADIOPRO_CRYSTAL_OSCILLATOR_LOAD_CAPACITANCE              0x09 */
#define  EZRADIOPRO_XLC_MASK           0x7F
#define  EZRADIOPRO_XTALSHFT           0x80

/* EZRADIOPRO_MICROCONTROLLER_OUTPUT_CLOCK                     0x0A */
#define  EZRADIOPRO_MCLK_MASK          0x07
#define  EZRADIOPRO_ENLFC              0x08
#define  EZRADIOPRO_CLKT_MASK          0x30

/* EZRADIOPRO_GPIO0_CONFIGURATION                              0x0B */
#define  EZRADIOPRO_GPIO0_MASK         0x1F
#define  EZRADIOPRO_PUP0               0x20
#define  EZRADIOPRO_GPIO0DRV_MASK      0xC0

/* EZRADIOPRO_GPIO1_CONFIGURATION                              0x0C */
#define  EZRADIOPRO_GPIO1_MASK         0x1F
#define  EZRADIOPRO_PUP1               0x20
#define  EZRADIOPRO_GPIO1DRV_MASK      0xC0

/* EZRADIOPRO_GPIO2_CONFIGURATION                              0x0D */
#define  EZRADIOPRO_GPIO2_MASK         0x1F
#define  EZRADIOPRO_PUP2               0x20
#define  EZRADIOPRO_GPIO2DRV_MASK      0xC0

/* EZRADIOPRO_IO_PORT_CONFIGURATION                            0x0E */
#define  EZRADIOPRO_DIO_MASK           0x07
#define  EZRADIOPRO_ITSDO              0x08
#define  EZRADIOPRO_EXTITST_MASK       0x70

/* EZRADIOPRO_ADC_CONFIGURATION                                0x0F */
#define  EZRADIOPRO_ADCGAIN_MASK        0x03
#define  EZRADIOPRO_ADCREF_MASK         0x0C
#define  EZRADIOPRO_ADCSEL_MASK         0x70
#define  EZRADIOPRO_ADCSTART            0x80  /* W */
#define  EZRADIOPRO_ADCDONE             0x80  /* R */

/* EZRADIOPRO_ADC_SENSOR_AMPLIFIER_OFFSET                      0x10 */
#define  EZRADIOPRO_ADCOFFS_MASK       0x0F

/* EZRADIOPRO_ADC_VALUE                                        0x11 */
/* No bits or mask */

/* EZRADIOPRO_TEMPERATURE_SENSOR_CONTROL                       0x12 */
#define  EZRADIOPRO_TSTRIM_MASK         0x0F
#define  EZRADIOPRO_ENTSTRIM            0x10
#define  EZRADIOPRO_ENTSOFFS            0x20
#define  EZRADIOPRO_TSRANGE_MASK        0xC0

/* EZRADIOPRO_TEMPERATURE_VALUE_OFFSET                         0x13 */
/* No bits or mask */

/* EZRADIOPRO_WAKE_UP_TIMER_PERIOD_1                           0x14 */
#define  EZRADIOPRO_WTD_MASK           0x03
#define  EZRADIOPRO_WTR_MASK           0x3C

/* EZRADIOPRO_WAKE_UP_TIMER_PERIOD_2                           0x15 */
/* no bits or mask */

/* EZRADIOPRO_WAKE_UP_TIMER_PERIOD_3                           0x16 */
#define  EZRADIOPRO_WTM_MASK           0x80

/* EZRADIOPRO_WAKE_UP_TIMER_VALUE_1                            0x17 */
/* No bits or mask */

