tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/Cygnal/REG51Si1000.H
/* EZRADIOPRO_CHARGEPUMP_CURRENT_TRIMMING_OVERRIDE             0x58 */
#define  EZRADIOPRO_CPCORR_MASK        0x1F
#define  EZRADIOPRO_CPCORROV           0x20
#define  EZRADIOPRO_CPCURR_MASK        0xC0

/* EZRADIOPRO_DIVIDER_CURRENT_TRIMMING                         0x59 */
#define  EZRADIOPRO_D1P5TRIM_MASK      0x03
#define  EZRADIOPRO_D2TRIM_MASK        0x0C
#define  EZRADIOPRO_D3TRIM_MASK        0x30
#define  EZRADIOPRO_FBDIVHC            0x40
#define  EZRADIOPRO_TXCORBOOSTEN       0x80

/* EZRADIOPRO_VCO_CURRENT_TRIMMING                             0x5A */
#define  EZRADIOPRO_VCOCUR_MASK        0x03
#define  EZRADIOPRO_VCOCORR_MASK       0x3C
#define  EZRADIOPRO_VCOCORROV          0x40
#define  EZRADIOPRO_TXCURBOOSTEN       0x80

/* EZRADIOPRO_VCO_CALIBRATION_OVERRIDE                         0x5B */
#define  EZRADIOPRO_VCOCAL_MASK        0x7F
#define  EZRADIOPRO_VCOCALOV           0x80  /* W */
#define  EZRADIOPRO_VCDONE             0x80  /* R */

/* EZRADIOPRO_SYNTHESIZER_TEST                                 0x5C */
#define  EZRADIOPRO_DSRST               0x01
#define  EZRADIOPRO_DSRSTMOD            0x02
#define  EZRADIOPRO_DSORDER_MASK        0x0C
#define  EZRADIOPRO_DSMOD               0x10
#define  EZRADIOPRO_ENOLOOP             0x20
#define  EZRADIOPRO_VCOTYPE             0x40
#define  EZRADIOPRO_DSMDT               0x80

/* EZRADIOPRO_BLOCK_ENABLE_OVERRIDE_1                          0x5D */
#define  EZRADIOPRO_ENMX2              0x01
#define  EZRADIOPRO_ENBF12             0x02
#define  EZRADIOPRO_ENDV32             0x04
#define  EZRADIOPRO_ENBF5              0x08
#define  EZRADIOPRO_ENPA               0x10
#define  EZRADIOPRO_ENPGA              0x20
#define  EZRADIOPRO_ENLNA              0x40
#define  EZRADIOPRO_ENMIX              0x80

/* EZRADIOPRO_BLOCK_ENABLE_OVERRIDE_2                          0x5E */
#define  EZRADIOPRO_PLLRESET           0x01
#define  EZRADIOPRO_ENBF2              0x02
#define  EZRADIOPRO_ENBF11             0x04
#define  EZRADIOPRO_ENBF3              0x08
#define  EZRADIOPRO_ENBF4              0x10
#define  EZRADIOPRO_ENMX3              0x20
#define  EZRADIOPRO_ENLDET             0x40
#define  EZRADIOPRO_ENDS               0x80

/* EZRADIOPRO_BLOCK_ENABLE_OVERRIDE_3                          0x5F */
#define  EZRADIOPRO_ENBG               0x01
#define  EZRADIOPRO_ENCP               0x02
#define  EZRADIOPRO_ENVCO              0x04
#define  EZRADIOPRO_DVBSHUNT           0x08
#define  EZRADIOPRO_ENDV1P5            0x10
#define  EZRADIOPRO_ENDV2              0x20
#define  EZRADIOPRO_ENDV31             0x40
#define  EZRADIOPRO_ENFRDV             0x80

/* EZRADIOPRO_CHANNEL_FILTER_COEFFICIENT_ADDRESS               0x60 */
#define  EZRADIOPRO_CHFILADD_MASK      0x0F

/* EZRADIOPRO_CHANNEL_FILTER_COEFFICIENT_VALUE                 0x61 */
#define  EZRADIOPRO_CHFILVAL_MASK      0x3F

/* EZRADIOPRO_CRYSTAL_OSCILLATOR_CONTROL_TEST                  0x62 */
#define  EZRADIOPRO_ENBUF              0x01
#define  EZRADIOPRO_BUFOVR             0x02
#define  EZRADIOPRO_ENAMP2X            0x04
#define  EZRADIOPRO_ENBIAS2X           0x08
#define  EZRADIOPRO_CLKHYST            0x10
#define  EZRADIOPRO_PWST_MASK          0xE0

/* EZRADIOPRO_RC_OSCILLATOR_COARSE_CALIBRATION_OVERRIDE        0x63 */
#define  EZRADIOPRO_RCC_MASK           0x7F
#define  EZRADIOPRO_RCCOV              0x80

/* EZRADIOPRO_RC_OSCILLATOR_FINE_CALIBRATION_OVERRIDE          0x64 */
#define  EZRADIOPRO_RCF_MASK           0x7F
#define  EZRADIOPRO_RCFOV              0x80

/* EZRADIOPRO_LDO_CONTROL_OVERRIDE                             0x65 */
#define  EZRADIOPRO_ENDIGPWDN          0x01
#define  EZRADIOPRO_ENDIGLDO           0x02
#define  EZRADIOPRO_ENPLLLDO           0x04
#define  EZRADIOPRO_ENRFLDO            0x08
#define  EZRADIOPRO_ENIFLDO            0x10
#define  EZRADIOPRO_ENVCOLDO           0x20
#define  EZRADIOPRO_ENBIAS             0x40
#define  EZRADIOPRO_ENSPOR             0x80

/* EZRADIOPRO_LDO_LEVEL_SETTING                                0x66 */
#define  EZRADIOPRO_DIGLVL_MASK        0x07
#define  EZRADIOPRO_ENRC32             0x10
#define  EZRADIOPRO_ENTS               0x20
#define  EZRADIOPRO_ENXTAL             0x40
#define  EZRADIOPRO_ENOVR              0x80

/* EZRADIOPRO_DELTASIGMA_ADC_TUNING_1                          0x67 */
#define  EZRADIOPRO_ADCTUNE_MASK       0x0F
#define  EZRADIOPRO_ADCTUNEOVR         0x10
#define  EZRADIOPRO_ENADC              0x20
#define  EZRADIOPRO_ENREFDAC           0x40
#define  EZRADIOPRO_ADCRST             0x80

/* EZRADIOPRO_DELTASIGMA_ADC_TUNING_2                          0x68 */
#define  EZRADIOPRO_DSADCREF_MASK      0x07
#define  EZRADIOPRO_ADCOLOOP           0x08
#define  EZRADIOPRO_ENVCM              0x10

/* EZRADIOPRO_AGC_OVERRIDE_1                                   0x69 */
#define  EZRADIOPRO_PGA_MASK           0x0F
#define  EZRADIOPRO_LNAGAIN            0x10
#define  EZRADIOPRO_AGCEN              0x20

/* EZRADIOPRO_AGC_OVERRIDE_2                                   0x6A */
#define  EZRADIOPRO_PGATH_MASK         0x03
#define  EZRADIOPRO_LNACOMP_MASK       0x3F
#define  EZRADIOPRO_AGCSLOW            0x40
#define  EZRADIOPRO_AGCOVPM            0x80

/* EZRADIOPRO_GFSK_FIR_FILTER_COEFFICIENT_ADDRESS              0x6B */
#define  EZRADIOPRO_FIRADD_MASK        0x07

/* EZRADIOPRO_GFSK_FIR_FILTER_COEFFICIENT_VALUE                0x6C */
#define  EZRADIOPRO_FIRVAL_MASK        0x3F

/* EZRADIOPRO_TX_POWER                                         0x6D */
#define  EZRADIOPRO_TXPOW_MASK         0x07

/* EZRADIOPRO_TX_DATA_RATE_1                                   0x6E */
/* No bits or mask */

/* EZRADIOPRO_TX_DATA_RATE_0                                   0x6F */
/* No bits or mask */

/* EZRADIOPRO_MODULATION_MODE_CONTROL_1                        0x70 */
#define  EZRADIOPRO_ENWHITE            0x01
#define  EZRADIOPRO_ENMANCH            0x02
#define  EZRADIOPRO_ENMANINV           0x04
#define  EZRADIOPRO_MANPPOL            0x08
#define  EZRADIOPRO_ENPHPWDN           0x10
#define  EZRADIOPRO_TXDTRTSCALE        0x20

/* EZRADIOPRO_MODULATION_MODE_CONTROL_2                        0x71 */
#define  EZRADIOPRO_MODTYP_MASK        0x03
#define  EZRADIOPRO_FD_MASK            0x04
#define  EZRADIOPRO_ENINV              0x08
#define  EZRADIOPRO_DTMOD_MASK         0x30
#define  EZRADIOPRO_TRCLK_MASK         0xC0
#define  EZRADIOPRO_MODTYP_GFSK        0x03
#define  EZRADIOPRO_FIFO_MODE          0x20
#define  EZRADIOPRO_TX_DATA_CLK_GPIO   0x40


/* EZRADIOPRO_FREQUENCY_DEVIATION                              0x72 */
/* No bits or mask */

/* EZRADIOPRO_FREQUENCY_OFFSET_1                               0x73 */
/* No bits or mask */

/* EZRADIOPRO_FREQUENCY_OFFSET_2                               0x74 */
#define  EZRADIOPRO_FO_MASK            0x03

/* EZRADIOPRO_FREQUENCY_BAND_SELECTRESERVED                    0x75 */
#define  EZRADIOPRO_FB_MASK            0x1F
#define  EZRADIOPRO_HBSEL              0x20
#define  EZRADIOPRO_SBSEL              0x40

/* EZRADIOPRO_NOMINAL_CARRIER_FREQUENCY_1                      0x76 */
/* No bits or mask */

/* EZRADIOPRO_NOMINAL_CARRIER_FREQUENCY_0                      0x77 */
/* No bits or mask */

/* EZRADIOPRO_FREQUENCY_HOPPING_CHANNEL_SELECT                 0x79 */
/* No bits or mask */

/* EZRADIOPRO_FREQUENCY_HOPPING_STEP_SIZE                      0x7A */
/* No bits or mask */

/* EZRADIOPRO_TX_FIFO_CONTROL_1                                0x7C */
#define  EZRADIOPRO_TXAFTHR_MASK       0x3F

/* EZRADIOPRO_TX_FIFO_CONTROL_2                                0x7D */
#define  EZRADIOPRO_TXAETHR_MASK       0x3F

/* EZRADIOPRO_RX_FIFO_CONTROL                                  0x7E */
#define  EZRADIOPRO_RXAFTHR_MASK       0x3F
#define  EZRADIOPRO_RESERVED           0x40

/* EZRADIOPRO_FIFO_ACCESS                                      0x7F */
/* No bits or mask */


#endif                                /* #define __REG51Si1000_H__           */